<a href="https://colab.research.google.com/github/OhOmah/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-07-09 20:11:06--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.200.197
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.200.197|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  31.9MB/s    in 6.8s

2020-07-09 20:11:14 (28.8 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [6]:
##### YOUR CODE HERE #####
# Importing the Orders.csv so I can work with the dataset and see what I need to from the data frame
import pandas as pd

order = pd.read_csv('orders.csv')

# Printing the first 5 rows to see how the data looks and if there's any mistakes

print(order.shape)
order.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [7]:
# Knowing that I don't need anything from the orders Dataframe I'm also going to import the Order_products__Prior to see if there's anything I need 

products = pd.read_csv('order_products__prior.csv')

print(products.shape)
products.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
# I'm going to need the product_id  from the previous data fram
# Now grabbing data from the train dataframe to see if I need anything from there as well

train = pd.read_csv('order_products__train.csv')

print(train.shape)
train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [9]:
# Finally grabbing the products data frame to see what I need from there
# Also realized naming the first df products wasn't really the best idea, maybe have it named based on the original file name since it was going to be combined anyways. 

products2 = pd.read_csv('products.csv')

print(products2.shape)
products2.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [10]:
'''
So I already know I don't need anything from the aisles.csv and the departments.csv dataframes and to grab and count the top 10 products sold 
I'm going to need the product name and id from products.csv
productid from order_products__train.csv
productid from order_products__prior.csv
and nothing from order.csv
'''
#Starting by concatenate order_products__prior and order_products__train

order_products = pd.concat([products, train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
# Before I'm going to merge anymore dataframes, I am going to filter the top ten products to slim down the dataframes to prevent any crashing
# I'm going to grab the product ids from product.csv and then filter them out for counting 
'''
Banana id 24852
Bag of Organic Bananas id 13176
Organic Strawberries id 21137
Organic Baby Spinach id 21903
Organic Hass Avocado id 47209
Organic Avocado id 47766
Large Lemon id 47626
Strawberries id 16797
Limes id 26209
Organic Whole Milk id 27845
'''
# I know there should be an easier way to do this even possibly with one line of code but can't find a way to do it without running into any errors. Less effienct but gives me the same result

condition = products2['product_name'] == 'Organic Whole Milk' 

products2[condition]

# Found out I was using the 'Or' operator wrong, I missed today's lecture and doing the assignment while watching it, just got to the part where Ryan mentioned the bitwise or operator
# Was orignally using the bitwise operation but I forgot to seperate my conditions in parenthesis hence the errors.

       product_id        product_name  aisle_id  department_id
27844       27845  Organic Whole Milk        84             16

In [12]:
# Know I know product id's I can filter them out in the order_products dataframe! 

order_subset = order_products[(order_products['product_id'] == 24852) |
                              (order_products['product_id'] == 13176) |
                              (order_products['product_id'] == 21137) |
                              (order_products['product_id'] == 21903) |
                              (order_products['product_id'] == 47209) |
                              (order_products['product_id'] == 47766) |
                              (order_products['product_id'] == 47626) |
                              (order_products['product_id'] == 16797) |
                              (order_products['product_id'] == 26209) |
                              (order_products['product_id'] == 21137) |
                              (order_products['product_id'] == 27845)
                              ] 
order_subset

         order_id  product_id  add_to_cart_order  reordered
12              3       21903                  4          1
30              5       13176                  1          1
51              5       47209                 22          0
77             10       24852                  1          1
80             10       47766                  4          1
...           ...         ...                ...        ...
1384519   3420895       47626                  6          1
1384538   3420909       21137                  9          1
1384546   3420996       24852                  1          1
1384561   3420998       21137                  5          1
1384563   3420998       21903                  7          1

[2418314 rows x 4 columns]

In [13]:
order_subset['product_id'].value_counts()

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [14]:
'''
id 24852 Banana 
id 13176 Bag of Organic Bananas 
id 21137 Organic Strawberries 
id 21903 Organic Baby Spinach 
id 47209 Organic Hass Avocado 
id 47766 Organic Avocado 
id 47626 Large Lemon 
id 16797 Strawberries 
id 26209 Limes 
id 27845 Organic Whole Milk 
'''

'\nid 24852 Banana \nid 13176 Bag of Organic Bananas \nid 21137 Organic Strawberries \nid 21903 Organic Baby Spinach \nid 47209 Organic Hass Avocado \nid 47766 Organic Avocado \nid 47626 Large Lemon \nid 16797 Strawberries \nid 26209 Limes \nid 27845 Organic Whole Milk \n'

In [15]:
# Comparing the original top 10 list and what I got from counting the values of each, everything matched up. Mission successful. 

# Since these were the top 10 products sold and value_counts counts auto sorts I didn't need to filter all the othe product ids out but thought getting the extra practice in 
# would be a great idea

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [49]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [50]:
# table2 -> tidy

table2 = table2.reset_index()

tidy = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [52]:
# Renaming the column names
tidy1 = tidy.rename(columns={
    'index': 'trt',
    'variable': 'name',
    'value': 'result'
})
tidy1

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [54]:
# Now taking treatment out 

tidy1.trt = tidy1.trt.str.replace('treatment', '')
tidy1

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [62]:
# tidy -> table
wide = tidy1.pivot_table(index='name', columns='trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [ ]:
import seaborn as sns
flights = sns.load_dataset('flights')

In [ ]:
# Flights Pivot Table
print(flights)

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####